package my20241214homework;

public class TimeStartLessons {
//    Составить список времен начала всех занятий по Java на декабрь 2024,
//    если предположить, что они проходят каждый вторник/четверг/пятницу c 9:30 CET.

//    Рейс из Лос-Анджелеса во Франкфурт отправляется в 15:05 по местному времени и длится 10 ч. 50 м.
//    Во сколько он прилетит? Написать метод, который мог бы совершать подобные вычисления.

//    ------------------
//    Напишите метод проверки логина и пароля.
//    Создать статический метод который принимает на вход три параметра: login, password и confirmPassword.
//    Login должен содержать только //латинские буквы//, длина login должна быть от //3 до 20 символов.//

//    Если login не соответствует этим требованиям, необходимо выбросить WrongLoginException.
//    Password должен содержать только цифры и латинские буквы. Длина password должна быть от 5 до 20 символов.
//    Также password и confirmPassword должны быть равны.

//    Если password не соответствует этим требованиям, необходимо выбросить WrongPasswordException.
//    WrongPasswordException и WrongLoginException - пользовательские классы исключения с двумя конструкторами – один по умолчанию,
//    второй принимает сообщение исключения и передает его в конструктор класса Exception. Обработка исключений проводится внутри метода.
//    Используем multi-catch block. Метод возвращает true, если значения верны или false в другом случае.

//    Пример вызова метода:
//    checkLoginAndPassword(john, 1234a, 1234a) --> true
//    checkLoginAndPassword(john, 12345, 123456) --> false
//    checkLoginAndPassword(john, 12345@, 12345@) --> false
//    checkLoginAndPassword(john1, 12345, 12345) --> false

}
